---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionZProfileWithLips
source: html/2ad6a15c-70c2-63bc-3e5a-e3a0e711be91.htm
---
# StructuralSectionZProfileWithLips Members

Creates a new instance of Structural Section Z Profile With Lips shape with the associated set of parameters,
 used to attach to structural element.